app/controllers/records_controller.rb

INSERT INTO "records" ("title", "artist", "year", "condition", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "test"], ["artist", "test"], ["year", 1990], ["condition", "Excellent"], ["created_at", "2018-06-21 11:28:12.274013"], ["updated_at", "2018-06-21 11:28:12.274013"]]
---
  def create
    @record = Record.new(record_params)

    respond_to do |format|
      if @record.save

UPDATE "records" SET "condition" = ?, "updated_at" = ? WHERE "records"."id" = ?  [["condition", "Broken"], ["updated_at", "2018-06-21 22:54:46.134286"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @record.update(record_params)

DELETE FROM "records" WHERE "records"."id" = ?  [["id", 2]]
---
  def destroy
    @record.destroy

SELECT  "records".* FROM "records" WHERE "records"."id" = ? LIMIT 1  [["id", 5]]
---
    def set_record
      @record = Record.find(params[:id])